documentation/discuss/hexes/hexes.org
#+PROPERTY: header-args:jupyter-python :session ~/jupyter-run/active-1-ssh.json
#+PROPERTY: header-args:jupyter :session ~/jupyter-run/active-1-ssh.json

#+STARTUP: overview
#+STARTUP: logdrawer
#+STARTUP: hideblocks

Let us setup an interactive ~Python~ session where we can run the code developed here.
#+BEGIN_SRC jupyter
print("Welcome to EMACS Jupyter")
#+END_SRC

#+RESULTS:
: Welcome to EMACS Jupyter
#+title: Hexes: A different set of flatmap columns.

We have an extensive configuration of the ususal 240 ~flatmap-columns~ that span the entire SSCx. There is an alternate version that has been used for several simulations. It is expected to cover the central area of the SSCx ~flatmap~. Here we will develop a ~connsense-pipeline~ to compute the same analyses as the ~flatmap-topology~ pipeline. The only difference is the input flatmap columns, which are now (<2023-03-31 Fri>) available as a dataframe.

To test the configuration, we will need to setup a ~Python~ environment,

* Setup

To get the notebook you will have to clone,
#+BEGIN_SRC shell
git clone https://bbpgitlab.epfl.ch/conn/structural/topological-analysis-of-subvolumes.git
git checkout beta
#+END_SRC

In our discussion we will develop scientific concepts to measure the circuit, and implement Python functions to compute them. Here we setup a notebook template to test and explore, and the structure of a ~Python~ package for our methods.

#+NAME: notebook-init
#+BEGIN_SRC jupyter-python
from importlib import reload
from collections.abc import Mapping
from collections import OrderedDict
from pprint import pprint, pformat
from pathlib import Path

import numpy as np
import pandas as pd

import matplotlib

reload(matplotlib)
from matplotlib import pylab as plt
import seaborn as sbn

from IPython.display import display

from bluepy import Synapse, Cell, Circuit

GOLDEN = (1. + np.sqrt(5.))/2.
print("We will plot golden aspect ratios: ", GOLDEN)
#+END_SRC

** Workspaces
We have run ~connsense-CRAP~ for the SSCx dissemination variant /Bio-M/, extracting data that we will use to compute the factology. Here is a list of workspaces we will need to generate factsheets.
#+NAME: notebook-workspaces
#+BEGIN_SRC jupyter-python
ROOTSPACE = Path("/")
PROJSPACE = ROOTSPACE / "gpfs/bbp.cscs.ch/project/proj83"
SOODSPACE = PROJSPACE / "home/sood"
HEXTAP = SOODSPACE / "topological-analysis-subvolumes/test/v2/hexes"
DEVSPACE  = HEXTAP / "test" / "develop"
#+END_SRC

** ~connsense~ Modules
While test-developing it will be good to have direct access to the ~connsense-TAP-store~ we will use. We will use a module from ~connsense~ to load the HDFstore,
#+NAME: notebook-connsense-tap
#+BEGIN_SRC jupyter-python
from connsense.develop import topotap as cnstap
hextap = cnstap.HDFStore(HEXTAP/"pipeline.yaml")
circuit = hextap.get_circuit("Bio_M")
print("Available analyses in topology tap: ")
pprint(hextap.analyses)
circuit
#+END_SRC

** Emacs specific :noexport:
We can get all figures displayed 95% so that we can work with them in front of us in an Emacs buffer. Here is a method that does that witb an example. This code is here only to see how much we use it. It should find a way to a place in our ~doom-config~.

#+NAME: fit-display-defun
#+BEGIN_SRC emacs-lisp
(defun fit-display-of (figure width height)
    (concat "#+attr_html: :width " width " :height " height (string ?\n) figure))
#+END_SRC

#+NAME: plot-display
#+HEADER: :var figure="" :var width="95%" :var height="95%"
#+BEGIN_SRC emacs-lisp
(fit-display-of figure width height)
#+END_SRC

#+HEADER: :post plot-display(*this*)
#+BEGIN_SRC jupyter-python :exports both :file ./test-fit-fig.png
,#+BEGIN_SRC jupyter-python :post attr-wrap(data=*this*) :session return :exports both :file ./test-fit-fig.png
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sbn

csv_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
col_names = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width','Class']
irisies = pd.read_csv(csv_url, names=col_names)

fig = plt.figure(figsize=(GOLDEN * 12, 12))
ax = sbn.histplot(x="Petal_Length", hue="Class", data=irisies, ax=fig.add_subplot())
#+END_SRC

#+RESULTS:
#+attr_html: :width 95% :height 95%

#+NAME: fit-display
#+HEADER: :var figure="" :var attr_value="95%" :var attr_name="#+attr_html: :width "
#+BEGIN_SRC emacs-lisp
(concat attr_name attr_ value (string ?\n) figure)
#+END_SRC

#+NAME: attr-wrap
#+BEGIN_SRC sh :var figure="" :var width="95%" :results output
echo "#+attr_html: :width $width"
echo "$figure"
#+END_SRC

#+RESULTS: attr-wrap
: #+attr_html: :width 95%
:

** Run the setup in EMACS :noexport:
Here we use ~noweb~ to include the code written there.
#+begin_src jupyter-python :noweb yes
<<notebook-init>>

<<notebook-workspaces>>

<<notebook-workspaces-portal>>

<<notebook-connsense-tap>>

<<notebook-connsense-tap-portal>>
#+end_src

* paths
We need to set paths to the artefacts that the pipeline will use. We set paths for the circuit to analyze, and the root space for the pipeline's HDF5 stores, and the HDF5 group for each of the pipeline steps. The only change we need to make here, building on the config we alread have for ~flatmap-columns~, is to set the ~pipeline.root~,

#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
paths:
  description: >-
    The ~connsense~ pipeline needs paths to the input data to load from, and output paths to store data.
    Paths to the circuit must be provided along with paths to the HDF5 archive that will store the pipeline's
    results.
  format: relative
  circuit:
    root: "/gpfs/bbp.cscs.ch/project/proj83/circuits"
    files:
      Bio_M: "Bio_M/20200805/CircuitConfig_TC_WM"
  pipeline:
    root: "/gpfs/bbp.cscs.ch/project/proj83/home/sood/topological-analysis-subvolumes/test/v2/hexes"
    input:
      store: "connsense.h5"
    output:
      store: "connsense.h5"
    steps:
      define-subtargets: "subtargets"
      extract-node-populations: "nodes/populations"
      extract-edge-populations: "edges/populations"
      analyze-connectivity: "analyses/connectivity"
#+end_src

* parameters
We provide the parameters for each step.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
parameters:
  description: >-
    Provide parameters that apply to each step.
#+end_src
The pipeline will ~define~ the ~subtargets~, ~extract~ circuit artefacts for the ~subtargets~, and ~analyze~ the results. Each of these ~steps~ need to be defined.

** define-subtargets
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
  define-subtargets:
    description: >-
      Configure the subtargets to analyze, entrying each definition as a key, value.
    definitions:
#+end_src
We define ~flatmap-columns~ which are prism like columns orientated along cortical layers, from white-matter to pia. The data is loaded from an ~NRRD~ that maps each circuit voxel to an ~id~ that corresponds to ~flatmap-column-subtarget~. We also need ~info~, a ~dataframe~ that provides information about these ~subtargets~ indexing them by the ~id~ from the ~NRRD~.
*** hexes
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      hexes:
        description: >-
          Columns like the flatmap columns, based on hexagonal tiling.
        input:
          circuit:
          - "Bio_M"
        kwargs:
          path: "/gpfs/bbp.cscs.ch/project/proj83/home/sood/topological-analysis-subvolumes/test/v2/hexes/hexes.csv"
        loader:
          source: "/gpfs/bbp.cscs.ch/project/proj83/home/sood/topological-analysis-subvolumes/test/v2/hexes/topology/pandas.py"
          method: "read_csv"
#+end_src
The ~input~ is set to a label that should appear among ~config-paths~. The ~loader~ method used is expected to take a ~bluepy.Circuit~ instance as an argument, which will be passed by ~connsense~.

We need to implement the ~read_csv~ method to load the ~hexmap-columns~,
#+begin_src jupyter-python :comments both :tangle ./topology/pandas.py
def read_csv(path):
    """..."""
    import pandas as pd
    subtargets_annotation = pd.read_csv(path)
    subtarget_ids = subtargets_annotation.subtarget_id
    subtargets = (pd.Index(subtarget_ids.unique(), name="subtarget_id").to_series()
                  .apply("Hex{}".format))
    circuit_gidses = subtargets_annotation.groupby("subtarget_id").gid.apply(list)
    return (subtargets, None, circuit_gidses)
#+end_src

We have already setup the paths to load the ~Python~ code above from ~connsense-.

** create-index
Within ~connsense~ we use an ~internal~ index for ~subtarget, circuit, connectome~. While we can infer this information from [[paths]] and [[define-subtargets]], we have not yet (<2023-02-13 Mon>) implemented this feature.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
  create-index:
    description:
      Create tap-store indices by listing datasets for each index variable.
    variables:
      circuit:
        - "Bio_M"
      connectome:
        - "local"
        - "intra_SSCX_midrange_wm"
        - "Thalamocortical_input_VPM"
        - "Thalamocortical_input_POM"
      subtarget:
        dataset: ["define-subtargets", "hexes/name"]
#+end_src

** extract-node-populations
We will extract populations of nodes, naming them as we would like to in our analyses to follow.

#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
  extract-node-populations:
    description: >-
      Specify the populations to extract from a circuit.
    populations:
#+end_src

*** default
The population of /non-barrel/ SSCx biophysical nodes will be the node-population that we analyze,
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      default:
        description: >-
          The default population will be that of neurons in the SSCx.
          To extract the neurons we will use a `connsense` method that uses ~bluepy~.
        input:
          subtarget:
            dataset:  ["define-subtargets", "hexes"]
          circuit:
            - "Bio_M"
        kwargs:
          properties:
            - region
            - layer
            - x
            - y
            - z
            - depth
            - synapse_class
            - mtype
            - etype
            - morphology
        extractor:
          source: connsense.extract_nodes.bluepy
          method: extract_node_properties
        output: "pandas.DataFrame"
#+end_src
