documentation/discuss/hexes/hexes.org
** extract-edge-populations
Just as for ~node-populations~ we will extract ~edge-populations~. Notice that the paths we have set in the ~tap-HDFStore~ are motivated by equivalent terminology in SONATA.

#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
  extract-edge-populations:
    description: >-
      Specify the edge populations to extract from a circuit.
    populations:
#+end_src
We will analyze topology of the ~local~ connectome that consists of the connections among cells based on their axo-dendritic appositions. To study the local connectivity of a ~subtarget~, we will need it's adjacency matrix that we can extract to the ~TAPStore~.

*** local
The population of local connections resulting from axo-dendritic appositions,
#+name: local-edges
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      local:
        input:
          subtarget:
            dataset:  ["define-subtargets", "hexes"]
          circuit:
            - "Bio_M"
          connectome:
            - "local"
        extractor:
          source: micasa.connsense.develop.extract.edge_populations.extract_connectivity
          method: extract_adj
        output: "sparse.spmatrix"
#+end_src

Normally extraction of edges will be a slow step.

*** long-range
We can extract /long-rage/ connectivity /between/ ~flatmap-columns~ by defining computations of pairs of ~flatmap-columns~.

Our initial goal of extracting ~long-range~ connectivity is to investigate the topolgical structure of simplices whose ~source-vertex lies in a selected ~flatmap-columns~. The ~source-subtarget~  ~flatmap-columns~ that we will be interested in will be determined by their ~innervation~ from thalamo-cortical projections.

We will extract two different ~long-range~ edge-populations. The edge-population ~long-range-sources~ (of the ~flatmap-columns~) will contain a ~list(adjacency-matrix)~ for each ~flatmap-column~. For a given ~flatmap-column~ ~X~, there will be one ~adjacency-matrix~ for each of another ~flatmap-column~ ~Y~. The ~adjacency-matrix~ for ~X, Y~ will contain edges that have their ~targets~ in ~X~, and ~sources~ in ~Y~.

#+begin_src jupyter-python
def long_range_sources(flatmap_column, source_flatmap_column=None):
    """Long range sources of a flatmap-column."""
    dataset = cnstap.TapDataset(tap, ("extract-edge-populations", "long-range-sources"))
    matrices = dataset.loc[flatmap_column, 0, 0]
    return matrices if not source_flatmap_column else matrices.loc[source_flatmap_column]
#+end_src
will give us a ~pandas.Series(adjacency-matrix)~, one for each ~flatmap-column~ among a selection of ~sources~.

For ~long-range-targets~,
#+begin_src jupyter-python
def long_range_targets(flatmap_column, target_flatmap_column=None):
    """Long range targets of a flatmap-column."""
    dataset = cnstap.TapDataset(tap, ("extract-edge-populations", "long-range-targets"))
    matrices = dataset.loc[flatmap_column, 0, 0]
    return matrices if not target_flatmap_column else matrices.loc[target_flatmap_column]
#+end_src

The population ~long-range-sources~ will be of edges (represented as (CSR) directed adjacency matrices), one for each pair ~(X, Y)~ of ~flatmap-columns~. The ~edge-population~ for a ~flatmap-column~  ~X~ will have it's ~targets~ among nodes in ~X~, while the ~sources~ of the edges will be among another. The primary index in ~connsense~ will be the ~flatmap-column~ that is receiving the ~incoming~ conenctions. With ~circuit, connectome~ specified, we will have another ~input~, the ~sources~ that will specify a subset of ~flatmap-columns~ to be /crossed/ with each dataset in ~connsense-TAP~ that matches the specification of ~subtarget, circuit, connectome~ inputs.

Well, finally we decided to keep things explicit, with a ~pre-~ and a ~post- specified as input arguments to the method that will extract the cross adjacency,

#+name: long-range-sources
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      long-range-cross:
        input:
          pre:
            dataset: ["define-subtargets", "flatmap-columns"]
            subset: [[100, 0]]
          circuit:
            - "Bio_M"
          connectome:
            - "local"
          post:
            dataset: ["define-subtargets", "hexes"]
          join: CROSS
        computation:
          source: micasa.connsense.develop.extract.edge_populations.extract_connectivity
          method: extract_cross_adj
        output: "sparse.spmatrix"
#+end_src

** analyze-connectivity
We will analyze several phenomena related to network topology, each entered in ~analyses~,
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
  analyze-connectivity:
    description: >-
      Configure each analyses' parameters, as a mapping under section `analyses`.
    analyses:
#+end_src
*** simplex-counts
We count the number of /simplices/ that is complete subgraphs of a given dimension /i.e/ the number of edges in the simplex. So a node is a simplex of dimension 0, an edge of dimension 1 while a dimension 2 will be a triangle. We will compute a series of simplex counts by dimension for each subtarget, 5 of it's Erdos-Renyi controls, subgraphs in each layer and their ER controls.
**** description
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      simplex-counts:
        description: >-
          Number of simplices by dimension.
#+end_src
**** input
We will compute ~simplex-counts~ for each of the ~flatmap-columns~, using ~adjacency~ matrices that we extract as dataset ~("extract-edge-populations", "local")~. We will also use ~node_properties~ that we extract as ~node-population~ ~default~.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        input:
          node_properties:
            dataset: ["extract-node-populations", "default"]
          adjacency:
            dataset: ["extract-edge-populations", "local"]
#+end_src
**** controls
We will use random controls for each ~subtarget~, entering them by name and value. We start with Erdos-Renyi controls, 5 of them specified by seed.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        controls:
          erdos-renyi:
            description: >-
              Erdos-Renyi shuffle of edges.
            seeds: [0, 1, 2, 3, 4]
            algorithm:
              source: "/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/randomization.py"
              method: "ER_shuffle"
#+end_src
**** slicing
We will slice each ~subtarget~ into ~subtgraphs~ consisting of each of the cortical layers. Thus a single ~subtarget~ should give us 6 of these ~slicings~. To compute analysis on a ~slicing~ we will have to enter it inside the ~analysis~ config.

We may store computation of each slice of a single subtarget as a ~datacall~. This will result in each slice of each subtarget to be sequenced as a ~unit-computation~. In ~connsense-parallelization~, we then parallelize based on the sizes of all the slices. The computation is seprated from that of ~full-subtargets~. This does not work well with ~simplex-counts~ as ~datacall~ of a single ~slice~ requires us to first load the adjacency matrices, then control them. With large adjacency matrices the computation of a unit ~slice-subtarget~ will require the same resources as loading the original full and randomizing it. Instead we will have to serially compute the slices' simplex-counts for each subtarget.

We can specify this in the config as ~compute_mode: EXECUTE~, instead of ~DATACALL~ which will create individual ~datacalls~, or ~DATASET~ that should save each ~slice-subtarget~ to a ~TapDataset~.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        slicing:
          description: >-
            Slice analysis input according to some rules.
          do-full: true #to run the original full matrices as well...
          layer:
            description: >-
              Intralayer subgraphs.
            compute_mode: EXECUTE
            slices:
              layer: [1, 2, 3, 4, 5, 6]
            algorithm:
              source: "/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py"
              method: "subgraph_intralayer"
#+end_src
**** computation
Finally, we need to specify the method to use to compute ~simplex-counts~ for each ~subtarget~, and the data-type of it's output.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        computation:
          source: "/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py"
          method: "simplex_counts"
        output: "pandas.Series"
#+end_src

*** simplex-source-count of cross connectivity
A simplex ~s~ is /efferent/ to a node ~n~ if each of it's vertices is /efferently/ connected to ~n~. Given a ~flatmap-column~s ~X~ and ~Y~, we want to count for each node ~x~ of ~X~ the number of simplices in ~y~ that are /efferent/ to ~x~.
**** description
#+header: :comments both :padline no :tangle no
#+begin_src yaml
      long-range-simplex-sources:
        description: >-
          For each node N in flatmap-column X, count the simplices in flatmap-column Y
          that are efferent to N
#+end_src
