documentation/discuss/hexes/hexes.org
**** input
We will compute ~simplex-counts~ for each of the ~flatmap-columns~, using ~adjacency~ matrices that we extract as dataset ~("extract-edge-populations", "local")~. We will also use ~node_properties~ that we extract as ~node-population~ ~default~.
#+header: :comments both :padline no :tangle no
#+begin_src yaml
        input:
          xadj:
            dataset: ["extract-edge-populations", "long-range/sources"]
          node_properties:
            datajoin:
              pre:
                dataset: ["extract-node-populations", "default"]
              post:
                dataset: ["extract-node-populations", "default"]
          adj:
            datajoin:
              pre:
                dataset: ["extract-edge-populations", "local"]
#+end_src
**** computation
Finally, we need to specify the method to use to compute ~simplex-counts~ for each ~subtarget~, and the data-type of it's output.
#+header: :comments both :padline no :tangle no
#+begin_src yaml
        computation:
          source: "/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py"
          method: "simplex_counts"
        output: "pandas.Series"
#+end_src

*** model-params-dd2
This analysis is used to create parameters for the distance dependent connection-probablity order 2 control model.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      model-params-dd2:
        description: >-
          Parameters for distance dependent connectivity model of order 2.
          Note that the `coord_names` in key `kwargs:` must agree with the configuration
          of the control model that will use the results of this analysis.
#+end_src
**** input
We will compute ~simplex-counts~ for each of the ~flatmap-columns~, using ~adjacency~ matrices that we extract as dataset ~("extract-edge-populations", "local")~. We will also use ~node_properties~ that we extract as ~node-population~ ~default~.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        input:
          node_properties:
            dataset: ["extract-node-populations", "default"]
          adjacency:
            dataset: ["extract-edge-populations", "local"]
#+end_src
**** computation
Finally, we need to specify the method to use to compute ~simplex-counts~ for each ~subtarget~, and the data-type of it's output.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        computation:
          source: "/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/modelling.py"
          method: "conn_prob_2nd_order_model"
        output: "pandas.DataFrame"
#+end_src
**** kwargs
The method that we will use to compute model parameters needs these parameters,
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        kwargs:
          bin_size_um: 50
          max_range_um: 1000
          sample_size: null
          coord_names: ["x", "y", "z"]
#+end_src

*** thalamic-innervation
We will compute the number of afferent-synapses on each neuron in a ~subtarget~ from the /thalamo-cortical/ projections.
**** description
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
      thalamic-innervation:
        description: >-
          Number of thalamo-cortical synapses at each cell in a subtarget.
#+end_src

**** vpm:
***** input
We will compute ~simplex-counts~ for each of the ~flatmap-columns~, using ~adjacency~ matrices that we extract as dataset ~("extract-edge-populations", "local")~. We will also use ~node_properties~ that we extract as ~node-population~ ~default~.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        vpm:
          description: >-
            Thalamic innervation of a subtarget, that originates in the VPM.
          input:
            subtarget:
              dataset: ["define-subtargets", "flatmap-columns"]
            circuit:
              - "Bio_M"
            connectome:
              - "Thalamocortical_input_VPM"
#+end_src
***** computation
Finally, we need to specify the method to use to compute ~simplex-counts~ for each ~subtarget~, and the data-type of it's output.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
          computation:
            source: micasa.connsense.develop.analyze.composition.projections.projections
            method: "innervate_cells"
          output: "pandas.Series"
#+end_src

**** pom:
***** input
We will compute ~simplex-counts~ for each of the ~flatmap-columns~, using ~adjacency~ matrices that we extract as dataset ~("extract-edge-populations", "local")~. We will also use ~node_properties~ that we extract as ~node-population~ ~default~.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
        pom:
          description: >-
            Thalamic innervation of a subtarget, that originates in the VPM.
          input:
            subtarget:
              dataset: ["define-subtargets", "flatmap-columns"]
            circuit:
              - "Bio_M"
            connectome:
              - "Thalamocortical_input_POM"
#+end_src
***** computation
Finally, we need to specify the method to use to compute ~simplex-counts~ for each ~subtarget~, and the data-type of it's output.
#+header: :comments both :padline no :tangle ./pipeline.yaml
#+begin_src yaml
          computation:
            source: micasa.connsense.develop.analyze.composition.projections.projections
            method: "innervate_cells"
          output: "pandas.Series"
#+end_src

*** cross-col-k-indegree
#+header: :comments both :padline no :tangle no
#+begin_src yaml
        description: >-
          Compute generalized in-degree of nodes in adj_target from nodes in adj_source.
          The k-in-degree of a node v is the number of k-simplices in adj_source with all its nodes mapping to v
          through edges in adj_cross
        input:
          adj_cross:
            dataset: ["extract-edge-populations", "long-range-cross"]
          adj_pre:
            dataset: ["extract-edge-populations", "local"]
            join_index:
              subtarget_id: pre_subtarget_id
              circuit_id: circuit_id
              connectome_id: DROP
#+end_src

* tap environment
With ~connsense~ we get the ~tap~ command line interface command that we can use to setup and run a pipeline. For example, we can change directory to the working space for ~hexes~ topology we are developing here. We place the pipeline configuration develop above, along with the ~runtime~ config there, and
#+begin_src shell
tap init
#+end_src
To formally setup a ~workspace~. We can now start running the pipeline step by step.
** define-subtargets
Before running any analyses we need to define the circuit's subtargets that we want to apply our analyses to. We have already configured the ~hexes~ as our ~subtargets~ above in [[parameters]]. We can get ~connsense~ to define them in the ~tap-store~ from CLI,
#+begin_src shell
tap init define-subtargets hexes
#+end_src
Once initialized, we can directly run this step. We expect definition of ~subtargets~ to a light-weight computation, and ~connsense~ does not parallelize --- as the quantity to parallelize over is defined in this step. To run the step,
#+begin_src shell
tap run define-subtargets hexes
#+end_src
Now we will have the subtargets in ~hextap~,
#+begin_src jupyter-python :exports both
hextap.subtarget_gids
#+end_src

#+RESULTS:
#+begin_example
subtarget_id
0     [301, 335, 381, 555, 855, 994, 1178, 1209, 156...
1     [225, 458, 757, 889, 966, 967, 1529, 1570, 160...
2     [323, 474, 492, 918, 1294, 2079, 2127, 2258, 2...
3     [159, 420, 613, 1228, 1288, 1406, 1487, 1634, ...
4     [23, 449, 531, 780, 1159, 1271, 1273, 1319, 14...
                            ...
73    [79, 210, 410, 431, 549, 620, 674, 907, 1561, ...
74    [143, 234, 403, 664, 748, 859, 925, 1107, 1578...
75    [86, 241, 383, 605, 630, 673, 705, 916, 979, 1...
76    [187, 194, 292, 326, 371, 599, 1013, 1266, 129...
77    [35, 164, 689, 1341, 1602, 1607, 1791, 1920, 2...
Name: gid, Length: 78, dtype: object
#+end_example

We have also /named/ the subtargets,
#+begin_src jupyter-python :exports both
hextap.subtargets
#+end_src

#+RESULTS:
#+begin_example
subtarget_id
0      Hex0
1      Hex1
2      Hex2
3      Hex3
4      Hex4
      ...
73    Hex73
74    Hex74
75    Hex75
76    Hex76
77    Hex77
Name: subtarget_id, Length: 78, dtype: object
#+end_example

