documentation/discuss/hexes/hexes.org
** extract-node-populations
For a pipeline step that will be parallelized, we need to setup it's execution,
#+begin_src shell
tap setup extract-node-popuations default
#+end_src

To run we will have to launch the launchscript. We need to change to the directory where the computation has been setup. Assuming that the current working directory is our ~hexes~ workspace,
#+begin_src shell
pushd run/extract-node-popuations/default
source launchscript.sh
#+end_src

We will provide a direct ~tap-command~ to launch the jobs from CLI. Once all the individual compute-nodes are done running, we can collect the results,
#+begin_src shell
popd
tap collect extract-node-populations default
#+end_src

The result,
#+begin_src jupyter-python :exports both
hextap.nodes.frame
#+end_src

#+RESULTS:
#+begin_example
subtarget  circuit
Hex0       Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex1       Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex2       Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex3       Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex4       Bio_M      <connsense.develop.parallelization.DataCall ob...
                                            ...
Hex73      Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex74      Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex75      Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex76      Bio_M      <connsense.develop.parallelization.DataCall ob...
Hex77      Bio_M      <connsense.develop.parallelization.DataCall ob...
Length: 78, dtype: object
#+end_example

where each entry contains a dataframe of node-properties (as configured in [[parameters]]),
#+begin_src jupyter-python
hextap.nodes.frame.iloc[0]()
#+end_src

#+RESULTS:
#+begin_example
             gid region  layer            x            y            z  \
node_id
0            301   S1FL      1  4497.177400 -1404.791079 -1710.819955
1            335   S1FL      1  4529.640691 -1224.749812 -1673.584629
2            381   S1FL      1  4424.035627 -1420.609607 -1623.004889
3            555   S1FL      1  4575.487255 -1256.955290 -1680.329358
4            855   S1FL      1  4414.041170 -1311.749811 -1591.684960
...          ...    ...    ...          ...          ...          ...
30185    4233691   S1FL      5  3858.396388 -1170.875301 -2300.017195
30186    4234066   S1FL      5  3917.853448 -1405.597989 -2489.396629
30187    4234649   S1FL      5  3883.928377 -1363.961085 -2391.425630
30188    4234716   S1FL      5  3678.588099 -1260.291591 -2620.444411
30189    4234804   S1FL      5  4002.636889 -1382.419711 -2641.743271

        synapse_class   mtype   etype  \
node_id
0                 INH  L1_DAC    cNAC
1                 INH  L1_DAC    cNAC
2                 INH  L1_DAC    cNAC
3                 INH  L1_DAC    bNAC
4                 INH  L1_DAC    cNAC
...               ...     ...     ...
30185             INH   L5_BP    bNAC
30186             INH   L5_BP  cACint
30187             INH   L5_BP    bNAC
30188             INH   L5_BP     bIR
30189             INH   L5_BP   dSTUT

                                                morphology        depth
node_id
0                                         sm090918b1-3_idB    53.713563
1            sm080930a1-5_idC_-_Scale_x1.000_y1.050_z1.000    57.538361
2                                         sm100513a1-3_idC    41.286367
3        sm120429_2photon_a1-3_idA_-_Scale_x1.000_y1.02...     0.095088
4            sm080930a1-5_idC_-_Scale_x1.000_y0.950_z1.000    52.138572
...                                                    ...          ...
30185     C240300C1_-_Scale_x1.000_y0.975_z1.000_-_Clone_0   944.835920
30186    rp110127_L5-2_idC_-_Scale_x1.000_y0.950_z1.000...  1061.802685
30187     C240300C1_-_Scale_x1.000_y0.950_z1.000_-_Clone_0   976.129286
30188    rp110127_L5-2_idC_-_Scale_x1.000_y1.025_z1.000...  1310.484541
30189                                  C240300C1_-_Clone_0  1134.050681

[30190 rows x 11 columns]
#+end_example


We will be using ~setup, launch, collect~ for each of the computations that we have configured.
